server/src/artillery_test/result_cluster.txt
Phase started: unnamed (index: 0, duration: 1s) 20:47:34(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 20:47:35(-0300)

--------------------------------------
Metrics for period to: 20:47:40(-0300) (width: 5.258s)
--------------------------------------

http.codes.200: ................................................................ 559
http.request_rate: ............................................................. 116/sec
http.requests: ................................................................. 609
http.response_time:
  min: ......................................................................... 105
  max: ......................................................................... 1753
  median: ...................................................................... 273.2
  p95: ......................................................................... 837.3
  p99: ......................................................................... 1002.4
http.responses: ................................................................ 559
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50


--------------------------------------
Metrics for period to: 20:47:50(-0300) (width: 9.162s)
--------------------------------------

http.codes.200: ................................................................ 1091
http.request_rate: ............................................................. 119/sec
http.requests: ................................................................. 1091
http.response_time:
  min: ......................................................................... 51
  max: ......................................................................... 1965
  median: ...................................................................... 104.6
  p95: ......................................................................... 925.4
  p99: ......................................................................... 1130.2
http.responses: ................................................................ 1091


--------------------------------------
Metrics for period to: 20:48:00(-0300) (width: 2.441s)
--------------------------------------

http.codes.200: ................................................................ 350
http.request_rate: ............................................................. 126/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 45
  max: ......................................................................... 1916
  median: ...................................................................... 79.1
  p95: ......................................................................... 907
  p99: ......................................................................... 1901.1
http.responses: ................................................................ 350
vusers.completed: .............................................................. 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 16475
  max: ......................................................................... 18332.5
  median: ...................................................................... 17505.6
  p95: ......................................................................... 18220
  p99: ......................................................................... 18220


All VUs finished. Total time: 19 seconds

--------------------------------
Summary report @ 20:47:53(-0300)
--------------------------------

http.codes.200: ................................................................ 2000
http.request_rate: ............................................................. 120/sec
http.requests: ................................................................. 2000
http.response_time:
  min: ......................................................................... 45
  max: ......................................................................... 1965
  median: ...................................................................... 202.4
  p95: ......................................................................... 907
  p99: ......................................................................... 1153.1
http.responses: ................................................................ 2000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 16475
  max: ......................................................................... 18332.5
  median: ...................................................................... 17505.6
  p95: ......................................................................... 18220
  p99: ......................................................................... 18220