server/src/artillery_test/result_fork.txt
Phase started: unnamed (index: 0, duration: 1s) 20:46:21(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 20:46:22(-0300)

--------------------------------------
Metrics for period to: 20:46:30(-0300) (width: 8.295s)
--------------------------------------

http.codes.200: ................................................................ 907
http.request_rate: ............................................................. 116/sec
http.requests: ................................................................. 957
http.response_time:
  min: ......................................................................... 46
  max: ......................................................................... 1917
  median: ...................................................................... 232.8
  p95: ......................................................................... 871.5
  p99: ......................................................................... 1085.9
http.responses: ................................................................ 907
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50


--------------------------------------
Metrics for period to: 20:46:40(-0300) (width: 9.339s)
--------------------------------------

http.codes.200: ................................................................ 1093
http.request_rate: ............................................................. 112/sec
http.requests: ................................................................. 1043
http.response_time:
  min: ......................................................................... 43
  max: ......................................................................... 1943
  median: ...................................................................... 90.9
  p95: ......................................................................... 907
  p99: ......................................................................... 1863.5
http.responses: ................................................................ 1093
vusers.completed: .............................................................. 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 15152.9
  max: ......................................................................... 18029.1
  median: ...................................................................... 17158.9
  p95: ......................................................................... 17859.2
  p99: ......................................................................... 17859.2


All VUs finished. Total time: 20 seconds

--------------------------------
Summary report @ 20:46:41(-0300)
--------------------------------

http.codes.200: ................................................................ 2000
http.request_rate: ............................................................. 114/sec
http.requests: ................................................................. 2000
http.response_time:
  min: ......................................................................... 43
  max: ......................................................................... 1943
  median: ...................................................................... 169
  p95: ......................................................................... 907
  p99: ......................................................................... 1107.9
http.responses: ................................................................ 2000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 15152.9
  max: ......................................................................... 18029.1
  median: ...................................................................... 17158.9
  p95: ......................................................................... 17859.2
  p99: ......................................................................... 17859.2